tap "aurc/loggo"
tap "codecrafters-io/tap"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "opencode-ai/tap"
tap "sst/tap"
brew "bat"
brew "btop"
brew "ripgrep"
brew "codex"
brew "exercism"
brew "eza"
brew "fd"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "go"
brew "hadolint"
brew "helix"
brew "jq"
brew "langgraph-cli"
brew "lazygit"
brew "llvm"
brew "lld"
brew "luarocks"
brew "mypy"
brew "neovim"
brew "opencode"
brew "pipx"
brew "poetry"
brew "posting"
brew "pre-commit"
brew "pyenv"
brew "python@3.12"
brew "tcl-tk"
brew "python-tk@3.12"
brew "qsv"
brew "redis"
brew "ruff"
brew "shellcheck"
brew "stow"
brew "tflint"
brew "tombi"
brew "uv"
brew "watchman"
brew "yazi"
brew "zoxide"
brew "aurc/loggo/loggo"
brew "codecrafters-io/tap/codecrafters"
brew "hashicorp/tap/terraform"
cask "aerospace"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-zed-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "keycastr"
cask "obs"
cask "warp"
